In [3]:
import pandas as pd

student_data = pd.read_csv('data/students_performance.csv')
display(student_data)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [5]:
student_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [7]:
student_data.iloc[155]

gender                               female
race/ethnicity                      group C
parental level of education    some college
lunch                              standard
test preparation course           completed
math score                               70
reading score                            89
writing score                            88
Name: 155, dtype: object

In [9]:
student_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [10]:
student_data['math score'].mean()

66.089

In [12]:
student_data['race/ethnicity'].mode()

0    group C
Name: race/ethnicity, dtype: object

In [16]:
student_data[student_data['test preparation course'] == 'completed']['reading score'].mean()

73.89385474860335

In [17]:
student_data[student_data['math score'] == 0].shape[0]

1

In [21]:
student_data[student_data['lunch'] == 'standard']['math score'].mean()

70.03410852713178

In [20]:
student_data[student_data['lunch'] == 'free/reduced']['math score'].mean()

58.92112676056338

In [28]:
parents = student_data[student_data['parental level of education'] == "bachelor's degree"].shape[0]
perc = (118 * 100) / 1000
print(perc)

11.8

In [38]:
a = student_data[student_data['race/ethnicity'] == 'group A']['writing score'].median()
c = student_data[student_data['race/ethnicity'] == 'group C']['writing score'].median()
print(abs(a - c))

6.0

In [36]:
c = student_data[student_data['race/ethnicity'] == 'group C']['writing score'].median()

In [3]:
import pandas as pd

countries_df = pd.DataFrame({
    'country': ['Англия', 'Канада', 'США', 'Россия', 
                'Украина', 'Беларусь', 'Казахстан'],
    'population': [56.29, 38.05, 322.28, 146.24, 
                   45.5, 9.5, 17.04],
    'square': [133396, 9984670, 9826630, 17125191, 
               603628, 207600, 2724902]
})

countries_df['density'] = countries_df['population'] / countries_df['square'] * 1e6
print(round(countries_df['density'].mean(), 2))

84.93

In [3]:
import pandas as pd

ufo_report = pd.read_csv('https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/ufo.csv', sep=',')
display (ufo_report)

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00
3,Abilene,NaN,DISK,KS,6/1/1931 13:00
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00
...,...,...,...,...,...
18236,Grant Park,NaN,TRIANGLE,IL,12/31/2000 23:00
18237,Spirit Lake,NaN,DISK,IA,12/31/2000 23:00
18238,Eagle River,NaN,NaN,WI,12/31/2000 23:45
18239,Eagle River,RED,LIGHT,WI,12/31/2000 23:45
18240,Ybor,NaN,OVAL,FL,12/31/2000 23:59

In [9]:
ufo_report['Time'] = pd.to_datetime(ufo_report.Time)
print(ufo_report['Time'].dt.year.mode()[0])

1999

In [24]:
# Найдите средний интервал времени (в днях)
# между двумя последовательными случаями наблюдения НЛО 
# в штате Невада (NV)
ufo_report['Date'] = ufo_report['Time'].dt.date
print(ufo_report[ufo_report['State'] == 'NV']['Date'].diff().dt.days.mean())

68.92932862190813